УчетВУправляющихДляГит1/src/Catalogs/КодыОперацийРаздела7ДекларацииПоНДС/КодыОперацийРаздела7ДекларацииПоНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КодыОперацийРаздела7ДекларацииПоНДС</name>
  <attributes>
    <name>ОперацияНеПодлежитНалогообложению</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНеоблагаемойОперации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВключаетсяВРеестрПодтверждающихДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Catalogs/КодыОперацийРаздела7ДекларацииПоНДС/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		ПодготовитьФормуНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПодготовитьФормуНаСервере()
	
	Если Объект.Ссылка.Пустая() Тогда
		ЗаполнитьФормуПоОбъекту();
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьФормуНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОперацияНеПодлежитНалогообложениюПриИзменении(Элемент)
	
	Если Объект.ОперацияНеПодлежитНалогообложению Тогда 
		Объект.ВключаетсяВРеестрПодтверждающихДокументов = Истина;
	Иначе
		Объект.ВключаетсяВРеестрПодтверждающихДокументов = Ложь;
		Объект.ВидНеоблагаемойОперации = "";
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ВключатьВРеестрПодтверждающихДокументовПриИзменении(Элемент)
	
	Если Не Объект.ВключаетсяВРеестрПодтверждающихДокументов Тогда 
		Объект.ВидНеоблагаемойОперации = "";
	КонецЕсли;
	
	УправлениеФормой(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьФормуПоОбъекту()
	
	ЗаполнитьЗначенияСвойств(Объект, Параметры.ЗначенияЗаполнения);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(ЭтотОбъект)
	
	Элементы = ЭтотОбъект.Элементы;
	Объект   = ЭтотОбъект.Объект;
	
	Элементы.ВключатьВРеестрПодтверждающихДокументов.Доступность = Объект.ОперацияНеПодлежитНалогообложению;
	Элементы.ВидНеоблагаемойОперации.Доступность = Объект.ВключаетсяВРеестрПодтверждающихДокументов;
	
КонецПроцедуры

#КонецОбласти
